## Plan Result (Aks_preview)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_role_assignment.disk
* Delete
  * module.kubernetes[&#34;00&#34;].azapi_resource.service_operator_credential
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.genesis_managed_identity_operator[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.global_registry_acrpull[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-preview-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
    }

  # azurerm_role_assignment.disk will be created
  + resource "azurerm_role_assignment" "disk" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "916381c3-3565-4fa9-80bc-1e7754942106"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azapi_resource.service_operator_credential will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azapi_resource" "service_operator_credential" {
      - body                      = jsonencode(
            {
              - properties = {
                  - audiences = [
                      - "api://AzureADTokenExchange",
                    ]
                  - issuer    = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/ae228581-8c7c-47c1-918e-2cd4c380470d/"
                  - subject   = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default"
                }
            }
        ) -> null
      - id                        = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-preview-mi/federatedIdentityCredentials/cft-preview-00-aks" -> null
      - ignore_casing             = false -> null
      - ignore_missing_property   = true -> null
      - name                      = "cft-preview-00-aks" -> null
      - output                    = jsonencode({})
      - parent_id                 = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-preview-mi" -> null
      - schema_validation_enabled = false -> null
      - tags                      = {} -> null
      - type                      = "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials@2022-01-31-preview" -> null
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.genesis_managed_identity_operator[0] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      - id                                     = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-preview-mi/providers/Microsoft.Authorization/roleAssignments/f6aef1be-7c4c-6df3-ace8-935416c2c069" -> null
      - name                                   = "f6aef1be-7c4c-6df3-ace8-935416c2c069" -> null
      - principal_id                           = "eee79ad4-9586-40cd-af88-4e1c76090e37" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> null
      - role_definition_name                   = "Managed Identity Operator" -> null
      - scope                                  = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-preview-mi" -> null
        # (4 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.global_registry_acrpull[0] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_role_assignment" "global_registry_acrpull" {
      - id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.Authorization/roleAssignments/3ce803db-cac2-9cf2-60da-23b09f0e259c" -> null
      - name                                   = "3ce803db-cac2-9cf2-60da-23b09f0e259c" -> null
      - principal_id                           = "eee79ad4-9586-40cd-af88-4e1c76090e37" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> null
      - role_definition_name                   = "AcrPull" -> null
      - scope                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg" -> null
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ clusters           = "00 01" -> "01"
  ~ kubelet_object_ids = "eee79ad4-9586-40cd-af88-4e1c76090e37,05dca73c-e67c-4343-a775-3ae6c5cd3853" -> "05dca73c-e67c-4343-a775-3ae6c5cd3853"
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.disks_resource_group has been deleted
  - resource "azurerm_resource_group" "disks_resource_group" {
      - id         = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/disks-preview-rg" -> null
        name       = "disks-preview-rg"
        tags       = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
            "startupMode"  = "always"
        }
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster has been deleted
  - resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
        id                                  = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/cft-preview-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-preview-00-aks"
        name                                = "cft-preview-00-aks"
      - oidc_issuer_url                     = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/ae228581-8c7c-47c1-918e-2cd4c380470d/" -> null
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (34 unchanged attributes hidden)

      - kubelet_identity {
          - object_id                 = "eee79ad4-9586-40cd-af88-4e1c76090e37" -> null
            # (2 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":624,"Program":"tfcmt","SHA1":"","Target":"Aks_preview","Vars":{}} -->